IDEA StatiCa Open Model
WeldEvaluation Enumeration
Compatible with IDEA StatiCa Beta 21.0 - beta
 WeldEvaluation
 Namespace: IdeaRS.OpenModel
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public enum WeldEvaluation
Public Enumeration WeldEvaluation
public enum class WeldEvaluation
Members
Member name | Value | Description
MaxForceElement | 0 |  Check is calculated in element with max force in weld (too conservative)
ForceResultant | 1 |  Check is calculated as resultant of all forces in weld
ApplyPlasticWelds | 4 |  Plasticity in welds is taken into account in AM
See Also
Reference
IdeaRS.OpenModel Namespace